11/data/attachments/ef743546416a7748.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_5e988d66-c39f-4d93-a2ee-289563e171dc</nif:username>
            <nif:friendToBeAdded>Heather_appear_Friend_47843_6</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>